/**
 * Created by sungjinyoo on 12/2/14.
 */

var FIRST_SEMESTER = 10;
var SECOND_SEMESTER = 20;
var SUMMER_SEMESTER = 15;
var WINTER_SEMESTER = 25;


var SEMESTERS = [
    FIRST_SEMESTER,
    SECOND_SEMESTER,
    SUMMER_SEMESTER,
    WINTER_SEMESTER
];

var TIME_TABLE_PERIODS = [
    ['0800', '0830'],
    ['0830', '0900'],
    ['0900', '0930'],
    ['0930', '1000'],
    ['1000', '1030'],
    ['1030', '1100'],
    ['1100', '1130'],
    ['1130', '1200'],
    ['1200', '1230'],
    ['1230', '1300'],
    ['1300', '1330'],
    ['1330', '1400'],
    ['1400', '1430'],
    ['1430', '1500'],
    ['1500', '1530'],
    ['1530', '1600'],
    ['1600', '1630'],
    ['1630', '1700'],
    ['1700', '1730'],
    ['1730', '1800'],
    ['1800', '1830'],
    ['1830', '1900'],
    ['1900', '1930'],
    ['1930', '2000'],
    ['2000', '2030'],
    ['2030', '2100'],
    ['2100', '2130'],
    ['2130', '2200'],
    ['2200', '2230'],
    ['2230', '2300'],
    ['2300', '2330'],
    ['2330', '2400']
];

var EXTRA_CATEGORY_VERBOSE = [
    "보강",
    "시험"
];

var COLOR_SELECT = [
    "additional_lecture",
    "exam",
    "assignment",
    "cancel_lecture"
];